{
  "entity_name": "Clone",
  "logic_type": "spell_mechanic",
  "mechanics": [
    {
      "type": "effect",
      "trigger": "Spell Casting Complete",
      "condition": "Target is a living creature",
      "outcome": "An inert clone duplicate of the target forms inside a sealed vessel; clone matures to full size and maturity after 120 days; clone can be a younger version of the creature; clone remains inert and endures indefinitely as long as its vessel remains undisturbed",
      "related_search_terms": [
        "clone creation",
        "duplicate body",
        "backup body",
        "resurrection preparation",
        "sealed vessel",
        "growth period"
      ]
    },
    {
      "type": "effect",
      "trigger": "Original creature dies",
      "condition": "Clone has matured AND original creature's soul is free AND original creature's soul is willing to return",
      "outcome": "Original creature's soul transfers to the clone; clone becomes the living original creature; the newly living creature has the same physical identity, personality, memories, and abilities as the original, but none of the original's equipment",
      "related_search_terms": [
        "revival",
        "reincarnation",
        "death prevention",
        "soul transfer",
        "respawn",
        "new body",
        "character death"
      ]
    },
    {
      "type": "constraint",
      "trigger": "Original creature's soul transfers to clone",
      "condition": "Original creature's physical remains still exist",
      "outcome": "Original remains become inert and cannot thereafter be restored to life",
      "related_search_terms": [
        "permanent death",
        "no other resurrection",
        "remains invalid",
        "soul already elsewhere"
      ]
    }
  ],
  "description_text": "This spell grows an inert duplicate of a living creature as a safeguard against death. This clone forms inside a sealed vessel and grows to full size and maturity after 120 days; you can also choose to have the clone be a younger version of the same creature. It remains inert and endures indefinitely, as long as its vessel remains undisturbed.At any time after the clone matures, if the original creature dies, its soul transfers to the clone, provided that the soul is free and willing to return. The clone is physically identical to the original and has the same personality, memories, and abilities, but none of the original's equipment. The original creature's physical remains, if they still exist, become inert and can't thereafter be restored to life, since the creature's soul is elsewhere.",
  "tags": [
    "spell",
    "necromancy"
  ],
  "related_search_terms": [
    "clone spell",
    "resurrection magic",
    "body duplication",
    "contingency plan",
    "death safeguard"
  ]
}