{
  "entity_name": "Wall of Thorns",
  "logic_type": "spell_mechanic",
  "mechanics": [
    {
      "type": "effect",
      "trigger": "On Spell Cast",
      "condition": "Target area is a solid surface within range",
      "outcome": "Create a wall lasting for the duration. Choose one: a) up to 60 feet long, 10 feet high, 5 feet thick OR b) a circle 20 feet diameter, up to 20 feet high, 5 feet thick.",
      "related_search_terms": [
        "barrier",
        "area denial",
        "conjuration",
        "spell dimensions",
        "obstruction"
      ]
    },
    {
      "type": "effect",
      "trigger": "Wall exists",
      "condition": "Line of sight passes through the wall",
      "outcome": "Line of sight is blocked",
      "related_search_terms": [
        "obscured",
        "vision block",
        "cover",
        "stealth",
        "visual hindrance"
      ]
    },
    {
      "type": "effect",
      "trigger": "When wall appears",
      "condition": "Creature is within the wall's area",
      "outcome": "Creature makes a Dexterity saving throw. On a failed save, creature takes 7d8 piercing damage. On a successful save, creature takes half as much piercing damage.",
      "related_search_terms": [
        "area damage",
        "initial effect",
        "conjuration damage",
        "spawn damage"
      ]
    },
    {
      "type": "effect",
      "trigger": "Creature moves through the wall",
      "condition": "Creature moves 1 foot through the wall",
      "outcome": "1 foot of movement costs 4 feet of movement",
      "related_search_terms": [
        "difficult terrain",
        "movement penalty",
        "slowed",
        "impeded movement"
      ]
    },
    {
      "type": "effect",
      "trigger": "Creature enters the wall for the first time on a turn OR ends its turn there",
      "condition": "Creature is within the wall",
      "outcome": "Creature makes a Dexterity saving throw. On a failed save, creature takes 7d8 slashing damage. On a successful save, creature takes half as much slashing damage.",
      "related_search_terms": [
        "hazard damage",
        "sustained damage",
        "area of effect damage",
        "thorny damage",
        "repeated damage"
      ]
    }
  ],
  "description_text": "You create a wall of tough, pliable, tangled brush bristling with needle-sharp thorns. The wall appears within range on a solid surface and lasts for the duration. You choose to make the wall up to 60 feet long, 10 feet high, and 5 feet thick or a circle that has a 20-foot diameter and is up to 20 feet high and 5 feet thick. The wall blocks line of sight. When the wall appears, each creature within its area must make a dexterity saving throw. On a failed save, a creature takes 7d8 piercing damage, or half as much damage on a successful save. A creature can move through the wall, albeit slowly and painfully. For every 1 foot a creature moves through the wall, it must spend 4 feet of movement. Furthermore, the first time a creature enters the wall on a turn or ends its turn there, the creature must make a dexterity saving throw. It takes 7d8 slashing damage on a failed save, or half as much damage on a successful one.",
  "tags": [
    "Spell",
    "Conjuration",
    "Control",
    "Damage",
    "Area_of_Effect",
    "Obstruction"
  ],
  "related_search_terms": [
    "Thorns",
    "Wall spell",
    "Area denial",
    "Difficult terrain",
    "Line of sight block",
    "Hazard",
    "Plant spell",
    "Nature magic"
  ]
}