{
  "entity_name": "Wish",
  "logic_type": "spell_mechanic",
  "mechanics": [
    {
      "type": "effect",
      "trigger": "On Cast",
      "condition": "Caster chooses to duplicate another spell of 8th level or lower",
      "outcome": "The chosen spell takes effect; caster does not need to meet any of its requirements, including costly components",
      "related_search_terms": [
        "duplicate spell",
        "mimic spell",
        "cast spell without components",
        "high level spell",
        "free spell"
      ]
    },
    {
      "type": "effect",
      "trigger": "On Cast",
      "condition": "Caster chooses to create an object; object is non-magical; object value is up to 25,000 gp; object size is no more than 300 feet in any dimension; object appears in an unoccupied space caster can see on the ground",
      "outcome": "One non-magical object appears in the specified space",
      "related_search_terms": [
        "create item",
        "conjure treasure",
        "materialize object",
        "gold object"
      ]
    },
    {
      "type": "effect",
      "trigger": "On Cast",
      "condition": "Caster chooses to heal and restore; up to 20 creatures visible to the caster",
      "outcome": "Affected creatures regain all hit points and all effects described in the greater restoration spell end on them",
      "related_search_terms": [
        "mass heal",
        "group healing",
        "remove conditions",
        "greater restoration effect"
      ]
    },
    {
      "type": "grant",
      "trigger": "On Cast",
      "condition": "Caster chooses to grant damage resistance; up to 10 creatures visible to the caster; caster chooses a damage type",
      "outcome": "Affected creatures gain resistance to the chosen damage type",
      "related_search_terms": [
        "group resistance",
        "damage buff",
        "elemental protection",
        "area resistance"
      ]
    },
    {
      "type": "grant",
      "trigger": "On Cast",
      "condition": "Caster chooses to grant immunity to a spell or magical effect; up to 10 creatures visible to the caster; caster chooses a single spell or other magical effect",
      "outcome": "Affected creatures gain immunity to the chosen spell or magical effect for 8 hours",
      "related_search_terms": [
        "magic immunity",
        "spell protection",
        "anti-magic",
        "lich counter",
        "magical defense"
      ]
    },
    {
      "type": "effect",
      "trigger": "On Cast",
      "condition": "Caster chooses to undo a single recent event; the event involved a roll made within the last round (including caster's last turn)",
      "outcome": "Force a reroll of the specified roll; caster can choose for the reroll to be made with advantage or disadvantage; caster chooses whether to use the reroll or the original roll",
      "related_search_terms": [
        "reroll",
        "undo action",
        "change outcome",
        "fate manipulation",
        "critical save",
        "failed save"
      ]
    },
    {
      "type": "effect",
      "trigger": "On Cast",
      "condition": "Caster desires an effect beyond the standard examples listed for Wish; GM has latitude in ruling",
      "outcome": "GM determines outcome, which may include partial success, failure, or unforeseen negative consequences for the caster (e.g., unintended time travel, teleportation, character removal from game)",
      "related_search_terms": [
        "DM discretion",
        "creative wish",
        "wish consequence",
        "monkey's paw",
        "unintended result",
        "narrative effect"
      ]
    },
    {
      "type": "constraint",
      "trigger": "After casting Wish",
      "condition": "Wish spell was cast to produce any effect OTHER than duplicating another spell",
      "outcome": "Caster takes 1d10 necrotic damage per level of each subsequent spell cast until their next long rest (damage cannot be reduced or prevented)",
      "related_search_terms": [
        "wish drawback",
        "spell stress",
        "painful casting",
        "damage on spellcast"
      ]
    },
    {
      "type": "effect",
      "trigger": "After casting Wish",
      "condition": "Wish spell was cast to produce any effect OTHER than duplicating another spell; caster's Strength score is greater than 3",
      "outcome": "Caster's Strength score drops to 3 for 2d4 days",
      "related_search_terms": [
        "stat drain",
        "strength loss",
        "weakened",
        "physical exhaustion"
      ]
    },
    {
      "type": "effect",
      "trigger": "During Strength recovery period",
      "condition": "Caster's Strength is reduced due to Wish; caster spends a day resting and doing nothing more than light activity",
      "outcome": "Remaining recovery time for Strength reduction decreases by 2 days",
      "related_search_terms": [
        "recovery time",
        "rest for healing",
        "reduced downtime"
      ]
    },
    {
      "type": "constraint",
      "trigger": "After casting Wish",
      "condition": "Wish spell was cast to produce any effect OTHER than duplicating another spell",
      "outcome": "There is a 33% chance the caster is unable to cast Wish ever again",
      "related_search_terms": [
        "lose wish spell",
        "permanent consequence",
        "spell loss",
        "uncastable"
      ]
    }
  ],
  "description_text": "Wish is the mightiest spell a mortal creature can cast. By simply speaking aloud, you can alter the very foundations of reality in accord with your desires. The basic use of this spell is to duplicate any other spell of 8th level or lower. You don't need to meet any requirements in that spell, including costly components. The spell simply takes effect. Alternatively, you can create one of the following effects of your choice: You create one object of up to 25,000 gp in value that isn't a magic item. The object can be no more than 300 feet in any dimension, and it appears in an unoccupied space you can see on the ground. You allow up to twenty creatures that you can see to regain all hit points, and you end all effects on them described in the greater restoration spell. You grant up to ten creatures that you can see resistance to a damage type you choose. You grant up to ten creatures you can see immunity to a single spell or other magical effect for 8 hours. For instance, you could make yourself and all your companions immune to a lich's life drain attack. You undo a single recent event by forcing a reroll of any roll made within the last round (including your last turn). Reality reshapes itself to accommodate the new result. For example, a wish spell could undo an opponent's successful save, a foe's critical hit, or a friend's failed save. You can force the reroll to be made with advantage or disadvantage, and you can choose whether to use the reroll or the original roll. You might be able to achieve something beyond the scope of the above examples. State your wish to the GM as precisely as possible. The GM has great latitude in ruling what occurs in such an instance; the greater the wish, the greater the likelihood that something goes wrong. This spell might simply fail, the effect you desire might only be partly achieved, or you might suffer some unforeseen consequence as a result of how you worded the wish. For example, wishing that a villain were dead might propel you forward in time to a period when that villain is no longer alive, effectively removing you from the game. Similarly, wishing for a legendary magic item or artifact might instantly transport you to the presence of the item's current owner. The stress of casting this spell to produce any effect other than duplicating another spell weakens you. After enduring that stress, each time you cast a spell until you finish a long rest, you take 1d10 necrotic damage per level of that spell. This damage can't be reduced or prevented in any way. In addition, your Strength drops to 3, if it isn't 3 or lower already, for 2d4 days. For each of those days that you spend resting and doing nothing more than light activity, your remaining recovery time decreases by 2 days. Finally, there is a 33 percent chance that you are unable to cast wish ever again if you suffer this stress.",
  "tags": [
    "9th-level spell",
    "arcane spell",
    "legendary spell",
    "reality alteration",
    "sorcerer spell",
    "wizard spell"
  ],
  "related_search_terms": [
    "wish spell",
    "ultimate power",
    "game breaking",
    "reality warping",
    "powerful magic",
    "high level magic"
  ]
}