{
  "entity_name": "Druidcraft",
  "logic_type": "spell_mechanic",
  "mechanics": [
    {
      "type": "effect",
      "trigger": "On Cast",
      "condition": "Caster chooses to predict weather for their current location",
      "outcome": "Create a tiny, harmless sensory effect predicting weather for the next 24 hours. Effect persists for 1 round.",
      "related_search_terms": [
        "weather forecast",
        "nature omen",
        "divination",
        "weather magic",
        "predict weather"
      ]
    },
    {
      "type": "effect",
      "trigger": "On Cast",
      "condition": "Caster chooses to manipulate a plant, targeting a flower, a seed pod, or a leaf bud within range",
      "outcome": "Instantly make the targeted flower bloom, seed pod open, or leaf bud bloom.",
      "related_search_terms": [
        "plant growth",
        "nature manipulation",
        "instant bloom",
        "seed magic",
        "flower magic"
      ]
    },
    {
      "type": "effect",
      "trigger": "On Cast",
      "condition": "Caster chooses to create a sensory effect, fitting within a 5-foot cube",
      "outcome": "Create an instantaneous, harmless sensory effect (e.g., falling leaves, puff of wind, animal sound, faint odor).",
      "related_search_terms": [
        "minor illusion",
        "sensory trick",
        "distraction",
        "nature illusion",
        "harmless effect"
      ]
    },
    {
      "type": "effect",
      "trigger": "On Cast",
      "condition": "Caster chooses to manipulate fire, targeting a candle, a torch, or a small campfire within range",
      "outcome": "Instantly light or snuff out the targeted light source or campfire.",
      "related_search_terms": [
        "fire control",
        "light source",
        "extinguish",
        "campfire magic",
        "illuminate",
        "darken"
      ]
    }
  ],
  "description_text": "Whispering to the spirits of nature, you create one of the following effects within 'range':- You create a tiny, harmless sensory effect that predicts what the weather will be at your location for the next 24 hours. The effect might manifest as a golden orb for clear skies, a cloud for rain, falling snowflakes for snow, and so on. This effect persists for 1 round.- You instantly make a flower bloom, a seed pod open, or a leaf bud bloom.- You create an instantaneous, harmless sensory effect, such as falling leaves, a puff of wind, the sound of a small animal, or the faint order of skunk. The effect must fit in a 5-foot cube.- You instantly light or snuff out a candle, a torch, or a small campfire.",
  "tags": [
    "cantrip",
    "druid",
    "utility",
    "nature",
    "evocation"
  ],
  "related_search_terms": [
    "minor magic",
    "nature magic",
    "druid spell",
    "utility cantrip",
    "prestidigitation equivalent"
  ]
}