{
  "entity_name": "Seeming",
  "logic_type": "spell_mechanic",
  "mechanics": [
    {
      "type": "effect",
      "trigger": "On Cast",
      "condition": "Target is a creature you can see within range AND Target is willing OR Target fails Charisma saving throw against your spell save DC",
      "outcome": "Target's physical appearance, clothing, armor, weapons, and equipment are changed to an illusory appearance",
      "related_search_terms": [
        "disguise",
        "illusion",
        "appearance alteration",
        "transform self"
      ]
    },
    {
      "type": "constraint",
      "trigger": "Targeting an Unwilling Creature",
      "condition": "Target is unwilling AND Target succeeds on a Charisma saving throw against your spell save DC",
      "outcome": "Target is unaffected by the spell",
      "related_search_terms": [
        "save vs spell",
        "resist magic",
        "charisma save"
      ]
    },
    {
      "type": "effect",
      "trigger": "Spell is active on target",
      "condition": "N/A",
      "outcome": "Target can appear 1 foot shorter or taller, thin, fat, or in between, but cannot change basic body type or limb arrangement",
      "related_search_terms": [
        "illusory height",
        "illusory weight",
        "body shape",
        "disguise self (group)"
      ]
    },
    {
      "type": "constraint",
      "trigger": "Physical inspection of illusory change",
      "condition": "An object or creature attempts to physically interact with an illusory aspect created by the spell",
      "outcome": "Interaction fails (objects pass through, physical contact reveals true form underneath)",
      "related_search_terms": [
        "illusion weakness",
        "detect illusion",
        "physical contact",
        "disbelief"
      ]
    },
    {
      "type": "effect",
      "trigger": "A creature uses its action to inspect a target",
      "condition": "Creature succeeds on an Intelligence (Investigation) check against your spell save DC",
      "outcome": "Creature becomes aware that the target is disguised",
      "related_search_terms": [
        "detect disguise",
        "see through illusion",
        "investigate illusion",
        "reveal magic"
      ]
    },
    {
      "type": "effect",
      "trigger": "Spell is active",
      "condition": "N/A",
      "outcome": "Spell lasts for its duration or until dismissed as an action",
      "related_search_terms": [
        "spell duration",
        "dismiss spell",
        "illusion duration"
      ]
    }
  ],
  "description_text": "This spell allows you to change the appearance of any number of creatures that you can see within range. You give each target you choose a new, illusory appearance. An unwilling target can make a charisma saving throw, and if it succeeds, it is unaffected by this spell. The spell disguises physical appearance as well as clothing, armor, weapons, and equipment. You can make each creature seem 1 foot shorter or taller and appear thin, fat, or in between. You can't change a target's body type, so you must choose a form that has the same basic arrangement of limbs. Otherwise, the extent of the illusion is up to you. The spell lasts for the duration, unless you use your action to dismiss it sooner. The changes wrought by this spell fail to hold up to physical inspection. For example, if you use this spell to add a hat to a creature's outfit, objects pass through the hat, and anyone who touches it would feel nothing or would feel the creature's head and hair. If you use this spell to appear thinner than you are, the hand of someone who reaches out to touch you would bump into you while it was seemingly still in midair. A creature can use its action to inspect a target and make an Intelligence (Investigation) check against your spell save DC. If it succeeds, it becomes aware that the target is disguised.",
  "tags": [
    "spell",
    "illusion",
    "enchantment",
    "social",
    "disguise"
  ],
  "related_search_terms": [
    "group illusion",
    "mass disguise",
    "appearance changing magic",
    "impersonation",
    "social infiltration"
  ]
}