[
  {
    "source_chapter": "The Planes of Existence",
    "extracted_concepts": [
      {
        "concept_name": "The Planes of Existence",
        "definition": "The distinct, interconnected dimensions and realms that form the D&D multiverse, each possessing unique physical and magical laws, as well as native inhabitants.",
        "rule_logic": {
          "premise": "Understanding the structure of the D&D multiverse",
          "implication": "Provides a cosmological framework for the origins of creatures, spells, divine powers, and potential adventure settings beyond the Material Plane.",
          "exceptions": [],
          "description_text": "The D&D multiverse is composed of numerous planes of existence. These are essentially entire universes, each with its own physical and magical laws, and its own inhabitants. They are typically categorized into a few major groups: the Material Plane (the prime setting for most campaigns), the Inner Planes (elemental forces), the Outer Planes (divine realms, afterlives, and philosophical alignments), and the Transitive Planes (linking other planes).",
          "is_exception": false,
          "related_search_terms": [
            "what are the planes of existence",
            "dnd multiverse",
            "other dimensions",
            "where do gods live",
            "astral plane",
            "ethereal plane",
            "elemental planes",
            "outer planes",
            "cosmology dnd"
          ]
        },
        "related_keywords": [
          "multiverse",
          "dimensions",
          "realms",
          "planes",
          "cosmology",
          "material plane",
          "inner planes",
          "outer planes",
          "transitive planes",
          "magic planes"
        ]
      }
    ],
    "_chunk_header": "Introduction",
    "_source_file": "the-planes-of-existence"
  },
  {
    "source_chapter": "The Planes of Existence",
    "extracted_concepts": [
      {
        "concept_name": "Planes of Existence",
        "definition": "The multitude of worlds and myriad alternate dimensions of reality that comprise the D&D cosmos, encompassing everything from the mundane Material Plane to realms of elemental matter, pure thought, and the dominions of gods, demons, and angels.",
        "rule_logic": {
          "premise": "The D&D cosmos is composed of various worlds and alternate dimensions of reality",
          "implication": "Spells, magic items, and high-level character abilities can draw energy from, summon denizens from, communicate with denizens of, and allow travel to these Planes of Existence",
          "exceptions": [],
          "description_text": "The cosmos teems with a multitude of worlds as well as myriad alternate dimensions of reality, called the planes of existence. It encompasses every world where GMs run their adventures, all within the relatively mundane realm of the Material Plane. Beyond that plane are domains of raw elemental matter and energy, realms of pure thought and ethos, the homes of demons and angels, and the dominions of the gods. Many spells and magic items can draw energy from these planes, summon the creatures that dwell there, communicate with their denizens, and allow adventurers to travel there. As your character achieves greater power and higher levels, you might walk on streets made of solid fire or test your mettle on a battlefield where the fallen are resurrected with each dawn.",
          "is_exception": false,
          "related_search_terms": [
            "what are the planes in dnd",
            "how do planes work dnd",
            "can I travel to other dimensions dnd",
            "what is the material plane",
            "planar travel dnd",
            "d&d dimensions",
            "cosmology dnd"
          ]
        },
        "related_keywords": [
          "multiverse",
          "dimensions",
          "Material Plane",
          "Elemental Planes",
          "Astral Plane",
          "Ethereal Plane",
          "Outer Planes",
          "gods",
          "demons",
          "angels",
          "magic",
          "spells",
          "magic items",
          "planar travel"
        ]
      }
    ],
    "_chunk_header": "The Planes of Existence",
    "_source_file": "the-planes-of-existence"
  },
  {
    "source_chapter": "The Multiverse - The Material Plane",
    "extracted_concepts": [
      {
        "concept_name": "The Material Plane",
        "definition": "The nexus where philosophical and elemental forces collide, forming the basis for mortal life and mundane matter across all fantasy gaming worlds.",
        "rule_logic": {
          "premise": "A campaign or adventure takes place in a fantasy gaming world",
          "implication": "That world exists within The Material Plane, serving as the starting point for most campaigns.",
          "exceptions": [],
          "description_text": "The Material Plane is the nexus where the philosophical and elemental forces that define the other planes collide in the jumbled existence of mortal life and mundane matter. All fantasy gaming worlds exist within the Material Plane, making it the starting point for most campaigns and adventures. The rest of the multiverse is defined in relation to the Material Plane. The worlds of the Material Plane are infinitely diverse, for they reflect the creative imagination of the GMs who set their games there, as well as the players whose heroes adventure there. They include magic-wasted desert planets and island-dotted water worlds, worlds where magic combines with advanced technology and others trapped in an endless Stone Age, worlds where the gods walk and places they have abandoned.",
          "is_exception": false,
          "related_search_terms": [
            "what is the material plane",
            "D&D campaign setting",
            "where do adventures start",
            "different worlds D&D",
            "planes of existence"
          ]
        },
        "related_keywords": [
          "Material Plane",
          "Multiverse",
          "Planes",
          "Campaign Setting",
          "World",
          "Fantasy Worlds"
        ]
      }
    ],
    "_chunk_header": "The Material Plane",
    "_source_file": "the-planes-of-existence"
  },
  {
    "source_chapter": "Beyond the Material",
    "extracted_concepts": [
      {
        "concept_name": "Planes of Existence",
        "definition": "Realms of myth and mystery that exist beyond the Material Plane, distinguished as different qualities of being, shaped and controlled by spiritual and elemental principles.",
        "rule_logic": {
          "premise": "When considering realms beyond the Material Plane",
          "implication": "These are identified as Planes of Existence, abstract from the ordinary world, governed by spiritual and elemental principles.",
          "exceptions": [],
          "description_text": "Beyond the Material Plane, the various planes of existence are realms of myth and mystery. They're not simply other worlds, but different qualities of being, formed and governed by spiritual and elemental principles abstracted from the ordinary world.",
          "is_exception": false,
          "related_search_terms": [
            "what are planes of existence",
            "how do planes work",
            "dimensions in D&D",
            "planar travel meaning",
            "beyond material plane"
          ]
        },
        "related_keywords": [
          "Planes of Existence",
          "Material Plane",
          "spiritual principles",
          "elemental principles",
          "realms",
          "dimensions"
        ]
      }
    ],
    "_chunk_header": "Beyond the Material",
    "_source_file": "the-planes-of-existence"
  },
  {
    "source_chapter": "Planar Travel",
    "extracted_concepts": [
      {
        "concept_name": "Planar Travel",
        "definition": "The act of moving between different planes of existence, considered a legendary journey.",
        "rule_logic": {
          "premise": "Adventurers intend to travel to a plane beyond the Material Plane",
          "implication": "Travel can be accomplished either by casting a spell or by using a planar portal",
          "exceptions": [],
          "description_text": "Travel to the planes beyond the Material Plane can be accomplished in two ways: by casting a spell or by using a planar portal.",
          "is_exception": false,
          "related_search_terms": [
            "how to travel between planes",
            "planes rules",
            "interdimensional travel",
            "what are planes of existence"
          ]
        },
        "related_keywords": [
          "interplanar travel",
          "planes of existence",
          "multiverse",
          "dimensional travel"
        ]
      },
      {
        "concept_name": "Planar Travel (Spells)",
        "definition": "A method of interplanar travel achieved through the use of specific magical spells.",
        "rule_logic": {
          "premise": "A spell is cast that grants access to other planes of existence",
          "implication": "The spell allows direct or indirect access to other planes of existence",
          "exceptions": [],
          "description_text": "A number of spells allow direct or indirect access to other planes of existence.",
          "is_exception": false,
          "related_search_terms": [
            "planar travel magic",
            "spells for plane travel",
            "dimensional spells"
          ]
        },
        "related_keywords": [
          "magic",
          "spellcasting",
          "dimensional magic"
        ]
      },
      {
        "concept_name": "Plane Shift / Gate (Spell)",
        "definition": "Spells that provide direct transportation to any other plane of existence.",
        "rule_logic": {
          "premise": "A creature casts the spell Plane Shift or Gate",
          "implication": "The spell transports the creature directly to any other plane of existence, with varying degrees of precision",
          "exceptions": [],
          "description_text": "*Plane shift* and *gate* can transport adventurers directly to any other plane of existence, with different degrees of precision.",
          "is_exception": false,
          "related_search_terms": [
            "plane shift spell effect",
            "gate spell destination",
            "direct plane travel spell"
          ]
        },
        "related_keywords": [
          "plane shift",
          "gate",
          "teleportation",
          "dimensional travel spell"
        ]
      },
      {
        "concept_name": "Etherealness (Spell)",
        "definition": "A spell that allows a creature to enter the Ethereal Plane and travel to planes it touches.",
        "rule_logic": {
          "premise": "A creature casts the Etherealness spell",
          "implication": "The creature enters the Ethereal Plane and can travel from there to planes it touches (e.g., Elemental Planes)",
          "exceptions": [],
          "description_text": "*Etherealness* allows adventurers to enter the Ethereal Plane and travel from there to any of the planes it touches-such as the Elemental Planes.",
          "is_exception": false,
          "related_search_terms": [
            "ethereal plane travel",
            "etherealness destination",
            "how to get to elemental planes"
          ]
        },
        "related_keywords": [
          "etherealness",
          "Ethereal Plane",
          "dimensional travel spell",
          "elemental planes"
        ]
      },
      {
        "concept_name": "Astral Projection (Spell)",
        "definition": "A spell that allows a creature to project themselves into the Astral Plane for travel to the Outer Planes.",
        "rule_logic": {
          "premise": "A creature casts the Astral Projection spell",
          "implication": "The creature projects themselves into the Astral Plane and can travel from there to the Outer Planes",
          "exceptions": [],
          "description_text": "And the *astral projection* spell lets adventurers project themselves into the Astral Plane and travel to the Outer Planes.",
          "is_exception": false,
          "related_search_terms": [
            "astral plane travel",
            "astral projection destination",
            "how to get to outer planes"
          ]
        },
        "related_keywords": [
          "astral projection",
          "Astral Plane",
          "Outer Planes",
          "spiritual travel",
          "dimensional travel spell"
        ]
      },
      {
        "concept_name": "Planar Portal",
        "definition": "A stationary interplanar connection linking a specific location on one plane to a specific location on another.",
        "rule_logic": {
          "premise": "A creature interacts with a planar portal (e.g., steps through it)",
          "implication": "Interplanar travel is effected, transporting the creature to the linked location on another plane",
          "exceptions": [],
          "description_text": "A portal is a general term for a stationary interplanar connection that links a specific location on one plane to a specific location on another. Some portals are like doorways, a clear window, or a fog-shrouded passage, and simply stepping through it effects the interplanar travel. Others are locations--circles of standing stones, soaring towers, sailing ships, or even whole towns-that exist in multiple planes at once or flicker from one plane to another in turn. Some are vortices, typically joining an Elemental Plane with a very similar location on the Material Plane, such as the heart of a volcano (leading to the Plane of Fire) or the depths of the ocean (to the Plane of Water).",
          "is_exception": false,
          "related_search_terms": [
            "what is a planar portal",
            "how do portals work",
            "types of planar portals",
            "interdimensional doorways",
            "vortex",
            "standing stones"
          ]
        },
        "related_keywords": [
          "interplanar gate",
          "dimensional gate",
          "vortex",
          "standing stones",
          "planar conduit",
          "fixed travel"
        ]
      }
    ],
    "_chunk_header": "Planar Travel",
    "_source_file": "the-planes-of-existence"
  },
  {
    "source_chapter": "Planes of Existence - Transitive Planes",
    "extracted_concepts": [
      {
        "concept_name": "Transitive Planes",
        "definition": "A classification for planes (Ethereal Plane and Astral Plane) that are mostly featureless realms and primarily serve as conduits for interplanar travel.",
        "rule_logic": {
          "premise": "Identify the Ethereal Plane or Astral Plane",
          "implication": "These planes primarily function as pathways for travel between other planes.",
          "exceptions": [],
          "description_text": "The Ethereal Plane and the Astral Plane are called the Transitive Planes. They are mostly featureless realms that serve primarily as ways to travel from one plane to another. Spells such as *etherealness* and *astral projection* allow characters to enter these planes and traverse them to reach the planes beyond.",
          "is_exception": false,
          "related_search_terms": [
            "what are transitive planes",
            "plane travel",
            "interplanar travel",
            "ethereal plane purpose",
            "astral plane purpose"
          ]
        },
        "related_keywords": [
          "Ethereal Plane",
          "Astral Plane",
          "Planar Travel",
          "Dimension"
        ]
      },
      {
        "concept_name": "Ethereal Plane",
        "definition": "A misty, fog-bound dimension often described as a great ocean, which exists as a transit plane. It includes the Border Ethereal (overlapping other planes) and the Deep Ethereal (its depths).",
        "rule_logic": {
          "premise": "Target is on the Material Plane or an Inner Plane",
          "implication": "A corresponding location exists on the Border Ethereal, overlapping the target's current location.",
          "exceptions": [],
          "description_text": "The Ethereal Plane is a misty, fog-bound dimension that is sometimes described as a great ocean. Its shores, called the Border Ethereal, overlap the Material Plane and the Inner Planes, so that every location on those planes has a corresponding location on the Ethereal Plane. Certain creatures can see into the Border Ethereal, and the *see invisibility* and *true seeing* spell grant that ability. Some magical effects also extend from the Material Plane into the Border Ethereal, particularly effects that use force energy such as *forcecage* and *wall of force.* The depths of the plane, the Deep Ethereal, are a region of swirling mists and colorful fogs.",
          "is_exception": false,
          "related_search_terms": [
            "ethereal plane description",
            "border ethereal",
            "deep ethereal",
            "ethereal travel",
            "etherealness spell"
          ]
        },
        "related_keywords": [
          "Plane",
          "Dimension",
          "Border Ethereal",
          "Deep Ethereal",
          "Material Plane",
          "Inner Planes",
          "Transitive Plane"
        ]
      },
      {
        "concept_name": "Ethereal Plane Visibility",
        "definition": "Rules governing the ability to perceive or interact with the Ethereal Plane from other planes.",
        "rule_logic": {
          "premise": "Creature possesses specific innate abilities OR *see invisibility* spell is active OR *true seeing* spell is active",
          "implication": "The creature can see into the Border Ethereal.",
          "exceptions": [],
          "description_text": "Certain creatures can see into the Border Ethereal, and the *see invisibility* and *true seeing* spell grant that ability.",
          "is_exception": false,
          "related_search_terms": [
            "see into ethereal plane",
            "ethereal vision",
            "see invisibility ethereal",
            "true seeing ethereal",
            "border ethereal visibility"
          ]
        },
        "related_keywords": [
          "Ethereal Plane",
          "Vision",
          "Spells",
          "Perception",
          "Border Ethereal"
        ]
      },
      {
        "concept_name": "Ethereal Plane Magical Effects",
        "definition": "Rules describing how certain magical effects can extend into the Border Ethereal.",
        "rule_logic": {
          "premise": "Magical effect uses force energy (e.g., *forcecage*, *wall of force*) AND is cast on the Material Plane",
          "implication": "The magical effect extends from the Material Plane into the Border Ethereal.",
          "exceptions": [],
          "description_text": "Some magical effects also extend from the Material Plane into the Border Ethereal, particularly effects that use force energy such as *forcecage* and *wall of force.*",
          "is_exception": false,
          "related_search_terms": [
            "ethereal plane spells",
            "force energy ethereal",
            "forcecage ethereal",
            "wall of force ethereal",
            "magic ethereal interaction"
          ]
        },
        "related_keywords": [
          "Ethereal Plane",
          "Magic",
          "Spells",
          "Force Energy",
          "Material Plane",
          "Border Ethereal"
        ]
      },
      {
        "concept_name": "Astral Plane",
        "definition": "The realm of thought and dream, serving as a transitive plane where visitors travel as disembodied souls to reach the planes of the divine and demonic. It appears as a vast, silvery sea with swirling wisps and motes of light.",
        "rule_logic": {
          "premise": "Characters use *astral projection* spell or similar means",
          "implication": "Characters can enter and traverse the Astral Plane, typically as disembodied souls, to reach the planes of the divine and demonic.",
          "exceptions": [],
          "description_text": "The Astral Plane is the realm of thought and dream, where visitors travel as disembodied souls to reach the planes of the divine and demonic. It is a great, silvery sea, the same above and below, with swirling wisps of white and gray streaking among motes of light resembling distant stars. Erratic whirlpools of color flicker in midair like spinning coins. Occasional bits of solid matter can be found here, but most of the Astral Plane is an endless, open domain.",
          "is_exception": false,
          "related_search_terms": [
            "astral plane description",
            "travel astral plane",
            "astral projection spell",
            "realm of thought",
            "disembodied souls"
          ]
        },
        "related_keywords": [
          "Plane",
          "Dimension",
          "Dream",
          "Thought",
          "Disembodied",
          "Divine Planes",
          "Demonic Planes",
          "Transitive Plane"
        ]
      }
    ],
    "_chunk_header": "Transitive Planes",
    "_source_file": "the-planes-of-existence"
  },
  {
    "source_chapter": "Cosmology - Inner Planes",
    "extracted_concepts": [
      {
        "concept_name": "Inner Planes",
        "definition": "A group of planes that surround and enfold the Material Plane and its echoes, providing the raw elemental substance for all worlds.",
        "rule_logic": {
          "premise": "Considering the structure of the cosmos",
          "implication": "The Inner Planes encompass the Elemental Planes and the Elemental Chaos, serving as a source of elemental matter.",
          "exceptions": [],
          "description_text": "The Inner Planes surround and enfold the Material Plane and its echoes, providing the raw elemental substance from which all the worlds were made.",
          "is_exception": false,
          "related_search_terms": [
            "cosmology",
            "planes of existence",
            "elemental substance",
            "material plane connection"
          ]
        },
        "related_keywords": [
          "Elemental Planes",
          "Elemental Chaos",
          "Material Plane",
          "Cosmology"
        ]
      },
      {
        "concept_name": "Elemental Planes",
        "definition": "Four specific planes (Air, Earth, Fire, Water) that form a ring around the Material Plane within the Inner Planes.",
        "rule_logic": {
          "premise": "Exploring the Inner Planes closer to the Material Plane",
          "implication": "These regions resemble the Material Plane with mingled elements (land, sea, sky). Further from the Material Plane, they are alien and hostile, consisting of pure, unmixed elements (solid earth, blazing fire, crystal-clear water, unsullied air).",
          "exceptions": [],
          "description_text": "The four Elemental Planes-Air, Earth, Fire, and Water-form a ring around the Material Plane, suspended within the churning Elemental Chaos. At their innermost edges, where they are closest to the Material Plane, the four Elemental Planes resemble a world in the Material Plane. The four elements mingle together as they do in the Material Plane, forming land, sea, and sky. Farther from the Material Plane, though, the Elemental Planes are both alien and hostile. Here, the elements exist in their purest form.",
          "is_exception": false,
          "related_search_terms": [
            "Plane of Fire",
            "Plane of Air",
            "Plane of Earth",
            "Plane of Water",
            "elemental realms",
            "cosmic structure",
            "border region"
          ]
        },
        "related_keywords": [
          "Inner Planes",
          "Elemental Chaos",
          "Material Plane",
          "Plane of Air",
          "Plane of Earth",
          "Plane of Fire",
          "Plane of Water"
        ]
      },
      {
        "concept_name": "Elemental Chaos",
        "definition": "The farthest extents of the Inner Planes, characterized by an unending tumult of clashing energies and colliding substance where pure elements dissolve and bleed together.",
        "rule_logic": {
          "premise": "Reaching the outermost edges of the Inner Planes",
          "implication": "Elements lose their pure form and merge into a chaotic, turbulent environment of raw, clashing energies.",
          "exceptions": [],
          "description_text": "At the farthest extents of the Inner Planes, the pure elements dissolve and bleed together into an unending tumult of clashing energies and colliding substance, the Elemental Chaos.",
          "is_exception": false,
          "related_search_terms": [
            "chaos plane",
            "elemental void",
            "outer inner planes",
            "cosmic maelstrom"
          ]
        },
        "related_keywords": [
          "Inner Planes",
          "Elemental Planes",
          "Chaos",
          "Cosmology"
        ]
      }
    ],
    "_chunk_header": "Inner Planes",
    "_source_file": "the-planes-of-existence"
  },
  {
    "source_chapter": "Outer Planes",
    "extracted_concepts": [
      {
        "concept_name": "Outer Planes",
        "definition": "Realms of thought, spirit, and purpose, primarily known as the homes of deities, characterized by a flexible landscape and variable distances.",
        "rule_logic": {
          "premise": "A realm exists beyond the Material Plane and Inner Planes that embodies direction, thought, and purpose",
          "implication": "It is an Outer Plane, often referred to as a divine, spiritual, or godly plane; its landscapes can change at the whims of powerful forces; distances can be highly variable and meaningless",
          "exceptions": [],
          "description_text": "If the Inner Planes are the raw matter and energy that makes up the multiverse, the Outer Planes are the direction, thought and purpose for such construction. Accordingly, many sages refer to the Outer Planes as divine planes, spiritual planes, or godly planes, for the Outer Planes are best known as the homes of deities. The landscape can change at the whims of the powerful forces that live on the Outer Planes. Distance is a virtually meaningless concept on the Outer Planes.",
          "is_exception": false,
          "related_search_terms": [
            "divine planes",
            "spiritual planes",
            "godly planes",
            "planar travel",
            "multiverse structure",
            "deity homes"
          ]
        },
        "related_keywords": [
          "planes",
          "multiverse",
          "deities",
          "spirit",
          "thought",
          "realm"
        ]
      },
      {
        "concept_name": "Upper Planes",
        "definition": "A category of Outer Planes that possess an inherent element of good in their nature.",
        "rule_logic": {
          "premise": "An Outer Plane has some element of good in its nature",
          "implication": "It is classified as an Upper Plane, and celestial creatures such as angels and pegasi dwell there",
          "exceptions": [],
          "description_text": "The planes with some element of good in their nature are called the Upper Planes. Celestial creatures such as angels and pegasi dwell in the Upper Planes.",
          "is_exception": false,
          "related_search_terms": [
            "good planes",
            "celestial homes",
            "angel planes",
            "good alignment planes"
          ]
        },
        "related_keywords": [
          "planes",
          "alignment",
          "good",
          "celestials",
          "realm"
        ]
      },
      {
        "concept_name": "Lower Planes",
        "definition": "A category of Outer Planes that possess an inherent element of evil in their nature.",
        "rule_logic": {
          "premise": "An Outer Plane has some element of evil in its nature",
          "implication": "It is classified as a Lower Plane, and fiends such as demons and devils dwell there",
          "exceptions": [],
          "description_text": "Planes with some element of evil are the Lower Planes. Fiends such as demons and devils dwell in the Lower Planes.",
          "is_exception": false,
          "related_search_terms": [
            "evil planes",
            "fiend homes",
            "demon planes",
            "evil alignment planes"
          ]
        },
        "related_keywords": [
          "planes",
          "alignment",
          "evil",
          "fiends",
          "realm"
        ]
      },
      {
        "concept_name": "Outer Plane Alignment Dissonance",
        "definition": "The profound sense of discomfort and being 'out of tune' experienced by a creature whose alignment does not match the inherent alignment essence of an Outer Plane.",
        "rule_logic": {
          "premise": "A creature's alignment does not match the inherent alignment essence of an Outer Plane it is visiting",
          "implication": "The creature experiences a profound sense of dissonance, feeling out of tune and uncomfortable",
          "exceptions": [],
          "description_text": "A plane's alignment is its essence, and a character whose alignment doesn't match the plane's experiences a profound sense of dissonance there. When a good creature visits Elysium, for example (a neutral good Upper Plane), it feels in tune with the plane, but an evil creature feels out of tune and more than a little uncomfortable.",
          "is_exception": false,
          "related_search_terms": [
            "alignment conflict",
            "plane discomfort",
            "evil on good plane",
            "good on evil plane",
            "planar effects",
            "planar alignment"
          ]
        },
        "related_keywords": [
          "planes",
          "alignment",
          "dissonance",
          "planar travel",
          "condition",
          "effect"
        ]
      },
      {
        "concept_name": "Demiplanes",
        "definition": "Small, extradimensional spaces with their own unique rules, which are pieces of reality that do not fit into the main planar structure.",
        "rule_logic": {
          "premise": "An extradimensional space exists with its own unique rules that does not fit into the established planar cosmology",
          "implication": "It is a demiplane, which can be created by spells (e.g., *demiplane*), desired by deities or powerful forces, or exist naturally as a fold of reality or a nascent universe",
          "exceptions": [],
          "description_text": "Demiplanes are small extradimensional spaces with their own unique rules. They are pieces of reality that don't seem to fit anywhere else. Demiplanes come into being by a variety of means. Some are created by spells, such as *demiplane,* or generated at the desire of a powerful deity or other force. They may exist naturally, as a fold of existing reality that has been pinched off from the rest of the multiverse, or as a baby universe growing in power.",
          "is_exception": false,
          "related_search_terms": [
            "pocket dimensions",
            "small planes",
            "created planes",
            "how demiplanes form",
            "extra-dimensional space"
          ]
        },
        "related_keywords": [
          "planes",
          "extradimensional",
          "reality",
          "creation",
          "space"
        ]
      },
      {
        "concept_name": "Demiplane Access",
        "definition": "The methods by which creatures can enter a demiplane.",
        "rule_logic": {
          "premise": "A creature desires to travel to or enter a demiplane",
          "implication": "Entry can occur through a single point where the demiplane touches another plane; a *gate* spell can reliably transport the caster if the demiplane is known; a *plane shift* spell can theoretically work, but requires an extremely hard-to-acquire tuning fork frequency",
          "exceptions": [],
          "description_text": "A given demiplane can be entered through a single point where it touches another plane. Theoretically, a *plane shift* spell can also carry travelers to a demiplane, but the proper frequency required for the tuning fork is extremely hard to acquire. The *gate* spell is more reliable, assuming the caster knows of the demiplane.",
          "is_exception": false,
          "related_search_terms": [
            "entering demiplane",
            "travel to demiplane",
            "plane shift demiplane",
            "gate demiplane",
            "demiplane portals",
            "how to get to a demiplane"
          ]
        },
        "related_keywords": [
          "demiplanes",
          "travel",
          "spells",
          "gate",
          "plane shift",
          "portal",
          "transport"
        ]
      }
    ],
    "_chunk_header": "Outer Planes",
    "_source_file": "the-planes-of-existence"
  }
]